#GIT -это распределенная система контроля версий
# Это система для отслеживания и ведения историй изменения в нашем проекте.При помощи гит можно организовать командную работу.

# GitHub -это веб сайт для размещения гит репозитериев в совместной разработке проектов

# Репозиторий-это хранилище нашего кода и историй его изменений 

#Команды GIT:
# 1.git init -создает удаленный репозитортй в той директории в которой была прописана команда
# 2.git add . - команда для добааления изиеннений в систему отслеживания гита (вместо точки можно прописать название директории)
# 3. git commit -m 'something' - это команда для сохранения всех изменнений с комментарием к ним
# 4. git branch -M -это команда переименовывает главную ветку мастер на мейн
# 5. git remote add orogin 'url' =это команда связывает наш локальный репозиторий с удаленным репозиторием на гитхабе
# 6. git push origin <main> - команда отправки наших изменений на удаленный репозиторий 
#===========================================================================================================================
# 7. git status - показывает статус репозитория (какие изменения не закомичены)
# 8. git branch -показывает на какой ветке вы находитесь




